In [1]:
import pandas as pd

In [2]:
data = {
    "Name": ["Alice", "Bob", "Charlie", "David"],
    "Age": [25, 30, 35, 40],
    "City": ["NY", "LA", "Bglr", "Hyd"]
}

In [9]:
df = pd.DataFrame(data)

In [13]:
df

      Name  Age  City
0    Alice   25    NY
1      Bob   30    LA
2  Charlie   35  Bglr
3    David   40   Hyd

In [14]:
df.set_index(["Name"], inplace=True)
df

         Age  City
Name
Alice     25    NY
Bob       30    LA
Charlie   35  Bglr
David     40   Hyd

In [15]:
df.loc["Alice"]

Age     25
City    NY
Name: Alice, dtype: object